import React from "react";

class Instructions {
    static shortInstruction() {
        return (
            <>
                <p>
                    Если фон и индикатор{" "}
                    <span className="true_text bold-text">фиолетого цвета</span>,
                    отвечайте честно.
                </p>
                <p>
                    Если фон и индикатор{" "}
                    <span className="lie_text bold-text">красного цвета</span>, ван нужно
                    солгать.
                </p>
            </>
        );
    }

    static longInstruction() {
        return (
            <div>
                <div className="instruction-block instruction-block-icon">
                    <svg
                        width="32"
                        height="32"
                        viewBox="0 0 32 32"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className="icon info-icon"
                    >
                        <path
                            d="M16.0001 30C18.7691 30 21.4758 29.1789 23.7781 27.6405C26.0804 26.1022 27.8748 23.9157 28.9344 21.3575C29.9941 18.7994 30.2713 15.9844 29.7311 13.2687C29.1909 10.553 27.8575 8.05841 25.8996 6.10048C23.9417 4.14254 21.4471 2.80917 18.7314 2.26898C16.0156 1.72878 13.2007 2.00603 10.6425 3.06566C8.08438 4.12528 5.89788 5.9197 4.35954 8.22199C2.8212 10.5243 2.00012 13.231 2.00012 16C2.00012 19.713 3.47511 23.274 6.10062 25.8995C8.72613 28.525 12.2871 30 16.0001 30V30ZM16.0001 3.99997C18.3735 3.99997 20.6936 4.70376 22.667 6.02234C24.6403 7.34091 26.1784 9.21505 27.0867 11.4078C27.9949 13.6005 28.2326 16.0133 27.7695 18.3411C27.3065 20.6688 26.1636 22.807 24.4854 24.4853C22.8072 26.1635 20.669 27.3064 18.3412 27.7694C16.0134 28.2324 13.6006 27.9948 11.4079 27.0865C9.2152 26.1783 7.34106 24.6402 6.02248 22.6668C4.7039 20.6934 4.00012 18.3733 4.00012 16C4.00012 12.8174 5.2644 9.76513 7.51484 7.51469C9.76527 5.26425 12.8175 3.99997 16.0001 3.99997Z"
                            fill="black"
                        />
                        <path d="M17.0001 24H15.0001V13H17.0001V24Z" fill="black" />
                        <path
                            d="M16.0001 9.99997C16.2968 9.99997 16.5868 9.912 16.8335 9.74717C17.0801 9.58235 17.2724 9.34808 17.3859 9.07399C17.4995 8.7999 17.5292 8.49831 17.4713 8.20733C17.4134 7.91636 17.2706 7.64909 17.0608 7.43931C16.851 7.22953 16.5837 7.08667 16.2928 7.02879C16.0018 6.97091 15.7002 7.00062 15.4261 7.11415C15.152 7.22768 14.9177 7.41994 14.7529 7.66661C14.5881 7.91329 14.5001 8.2033 14.5001 8.49997C14.5001 8.89779 14.6582 9.27932 14.9395 9.56063C15.2208 9.84193 15.6023 9.99997 16.0001 9.99997Z"
                            fill="black"
                        />
                    </svg>
                    <div>
                        <p>
                            Целью онлайн-интервью является уточнение Ваших компетенций для
                            последующего формирования команд исполнителей научных проектов.
                        </p>
                        <p>
                            <span>Ход интервью</span>
                        </p>
                        <p>
                            В ходе него Вам будет предложен ряд вопросов, при составлении
                            которых основное внимание уделялось тем темам, которые наиболее
                            существенны для работы в команде.
                        </p>
                        <p>Вопросы разбиты на 3 блока.</p>
                        <ol className="block-list">
                            <li>
                                <span>Сфера профессиональных компетенций  </span>
                                - данный блок вопросов оценивает осознание собственного
                                профессионализма и возможность эффективно представлять его
                                другим.
                            </li>

                            <li>
                                <span>Работа в команде </span>
                                - данный блок оценивает желание в полной мере участвовать в работе
                                в команде, готовность внести эффективный вклад в работу команды.
                            </li>

                            <li>
                                <span>Коммуникация </span>
                                - данный блок оценивает способность выражать идеи или факты в
                                ясной и убедительной манере.
                            </li>
                        </ol>
                    </div>
                </div>
                <div className="instruction-flex">
                    <div className="instruction-block instruction-block--info instruction-block-icon margin-0">
                        <svg
                            width="32"
                            height="32"
                            viewBox="0 0 32 32"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                            className="icon info-icon"
                        >
                            <path
                                d="M16.0001 30C18.7691 30 21.4758 29.1789 23.7781 27.6405C26.0804 26.1022 27.8748 23.9157 28.9344 21.3575C29.9941 18.7994 30.2713 15.9844 29.7311 13.2687C29.1909 10.553 27.8575 8.05841 25.8996 6.10048C23.9417 4.14254 21.4471 2.80917 18.7314 2.26898C16.0156 1.72878 13.2007 2.00603 10.6425 3.06566C8.08438 4.12528 5.89788 5.9197 4.35954 8.22199C2.8212 10.5243 2.00012 13.231 2.00012 16C2.00012 19.713 3.47511 23.274 6.10062 25.8995C8.72613 28.525 12.2871 30 16.0001 30V30ZM16.0001 3.99997C18.3735 3.99997 20.6936 4.70376 22.667 6.02234C24.6403 7.34091 26.1784 9.21505 27.0867 11.4078C27.9949 13.6005 28.2326 16.0133 27.7695 18.3411C27.3065 20.6688 26.1636 22.807 24.4854 24.4853C22.8072 26.1635 20.669 27.3064 18.3412 27.7694C16.0134 28.2324 13.6006 27.9948 11.4079 27.0865C9.2152 26.1783 7.34106 24.6402 6.02248 22.6668C4.7039 20.6934 4.00012 18.3733 4.00012 16C4.00012 12.8174 5.2644 9.76513 7.51484 7.51469C9.76527 5.26425 12.8175 3.99997 16.0001 3.99997Z"
                                fill="black"
                            />
                            <path d="M17.0001 24H15.0001V13H17.0001V24Z" fill="black" />
                            <path
                                d="M16.0001 9.99997C16.2968 9.99997 16.5868 9.912 16.8335 9.74717C17.0801 9.58235 17.2724 9.34808 17.3859 9.07399C17.4995 8.7999 17.5292 8.49831 17.4713 8.20733C17.4134 7.91636 17.2706 7.64909 17.0608 7.43931C16.851 7.22953 16.5837 7.08667 16.2928 7.02879C16.0018 6.97091 15.7002 7.00062 15.4261 7.11415C15.152 7.22768 14.9177 7.41994 14.7529 7.66661C14.5881 7.91329 14.5001 8.2033 14.5001 8.49997C14.5001 8.89779 14.6582 9.27932 14.9395 9.56063C15.2208 9.84193 15.6023 9.99997 16.0001 9.99997Z"
                                fill="black"
                            />
                        </svg>

                        <p>

                            <span>ВАЖНО:</span> ответы на вопросы должны быть <span>искренними</span>, <span>содержательными</span> и
                            <sapn>подкреплены аргументами(фактами, примерами из Вашего личного
                                опыта).</sapn>

                        </p>
                    </div>
                    <div className="instruction-block instruction-block--danger instruction-block-icon margin-0">
                        <svg
                            width="32"
                            height="32"
                            viewBox="0 0 32 32"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                            className="icon info-icon"
                        >
                            <path
                                d="M16.0001 30C18.7691 30 21.4758 29.1789 23.7781 27.6405C26.0804 26.1022 27.8748 23.9157 28.9344 21.3575C29.9941 18.7994 30.2713 15.9844 29.7311 13.2687C29.1909 10.553 27.8575 8.05841 25.8996 6.10048C23.9417 4.14254 21.4471 2.80917 18.7314 2.26898C16.0156 1.72878 13.2007 2.00603 10.6425 3.06566C8.08438 4.12528 5.89788 5.9197 4.35954 8.22199C2.8212 10.5243 2.00012 13.231 2.00012 16C2.00012 19.713 3.47511 23.274 6.10062 25.8995C8.72613 28.525 12.2871 30 16.0001 30V30ZM16.0001 3.99997C18.3735 3.99997 20.6936 4.70376 22.667 6.02234C24.6403 7.34091 26.1784 9.21505 27.0867 11.4078C27.9949 13.6005 28.2326 16.0133 27.7695 18.3411C27.3065 20.6688 26.1636 22.807 24.4854 24.4853C22.8072 26.1635 20.669 27.3064 18.3412 27.7694C16.0134 28.2324 13.6006 27.9948 11.4079 27.0865C9.2152 26.1783 7.34106 24.6402 6.02248 22.6668C4.7039 20.6934 4.00012 18.3733 4.00012 16C4.00012 12.8174 5.2644 9.76513 7.51484 7.51469C9.76527 5.26425 12.8175 3.99997 16.0001 3.99997Z"
                                fill="black"
                            />
                            <path d="M17.0001 24H15.0001V13H17.0001V24Z" fill="black" />
                            <path
                                d="M16.0001 9.99997C16.2968 9.99997 16.5868 9.912 16.8335 9.74717C17.0801 9.58235 17.2724 9.34808 17.3859 9.07399C17.4995 8.7999 17.5292 8.49831 17.4713 8.20733C17.4134 7.91636 17.2706 7.64909 17.0608 7.43931C16.851 7.22953 16.5837 7.08667 16.2928 7.02879C16.0018 6.97091 15.7002 7.00062 15.4261 7.11415C15.152 7.22768 14.9177 7.41994 14.7529 7.66661C14.5881 7.91329 14.5001 8.2033 14.5001 8.49997C14.5001 8.89779 14.6582 9.27932 14.9395 9.56063C15.2208 9.84193 15.6023 9.99997 16.0001 9.99997Z"
                                fill="black"
                            />
                        </svg>
                        <p>
                            <span>ВАЖНО:</span> между указанными блоками будут вопросы, при
                            ответе на которые необходимо сказать <span>неправду</span>. Такие вопросы буду
                            отмечены специальным красным индикатором с надписью{" "}
                            <span>&#171;соврите&#187;</span>.
                            <p>
                                Необходимо дать ответ, в точности противоположный вашему мнению, и
                                попытаться <span>обосновать</span>, почему же именно так (т.е. говорить
                                неправду в течение всего вопроса).
                            </p>
                        </p>
                    </div>
                </div>
                <div className="instruction-block instruction-block--success instruction-block-icon">
                    <svg
                        width="32"
                        height="32"
                        viewBox="0 0 32 32"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className="icon warning-icon"
                    >
                        <path
                            d="M7.10666 4.36134C7.99604 4.04398 8.96078 4.00391 9.87342 4.24641C10.7861 4.48891 11.6036 5.00258 12.2182 5.71955C12.8327 6.43652 13.2153 7.32305 13.3154 8.26204C13.4155 9.20103 13.2283 10.1483 12.7787 10.9787L27.0573 25.2587L25.172 27.144L10.892 12.864C10.0614 13.3119 9.11465 13.4976 8.17644 13.3967C7.23822 13.2958 6.3526 12.9129 5.63628 12.2987C4.91995 11.6844 4.40655 10.8675 4.16372 9.9557C3.92089 9.04385 3.96004 8.07983 4.276 7.19067L7.25866 10.1733C7.44316 10.3644 7.66385 10.5167 7.90785 10.6215C8.15186 10.7264 8.4143 10.7815 8.67986 10.7838C8.94542 10.7861 9.20878 10.7355 9.45457 10.635C9.70036 10.5344 9.92367 10.3859 10.1115 10.1981C10.2992 10.0103 10.4477 9.78704 10.5483 9.54124C10.6489 9.29545 10.6995 9.03209 10.6972 8.76653C10.6949 8.50097 10.6397 8.23853 10.5349 7.99453C10.43 7.75052 10.2777 7.52983 10.0867 7.34534L7.10533 4.36L7.10666 4.36134ZM20.9293 6.87334L25.172 4.516L27.0573 6.40134L24.7 10.644L22.3427 11.116L19.516 13.944L17.6293 12.0587L20.4573 9.23067L20.9293 6.87334V6.87334ZM11.972 17.716L13.8573 19.6013L6.78666 26.672C6.54626 26.9131 6.22274 27.0531 5.88244 27.0633C5.54213 27.0734 5.21081 26.9531 4.95642 26.7268C4.70202 26.5005 4.54381 26.1855 4.51423 25.8464C4.48465 25.5072 4.58594 25.1696 4.79733 24.9027L4.90133 24.7867L11.972 17.716Z"
                            fill="black"
                        />
                    </svg>
                    <div>
                        <p>
                            <span>Порядок прохождения интервью</span>
                        </p>
                        <ol className="block-list">
                            <li>После нажатия кнопки <span>&#171;Начать интервью&#187;</span>{" "}
                                появится окно, в котором будет отображен вопрос и индикатор, как на него нужно ответить.
                            </li>
                            <li>
                                Внимательно прочитайте вопрос и когда будете готовы отвечать,
                                нажмите кнопку <span>&#171;Начать ответ&#187;</span>. После ответа
                                на вопрос необходимо нажать на кнопку{" "}
                                <span>&#171;Закончить ответ&#187;</span>, после чего появится новый
                                вопрос. Кнопка <span>&#171;Закончить ответ&#187;</span> заблокирована первые 10 секунд.
                            </li>
                            <li>
                                После ответа на все вопросы появится окно с текстом {" "}
                                <span>&#171;Спасибо за прохождение интервью!&#187;</span>, поcле чего Вы сможете закрыть страницу.
                            </li>
                        </ol>
                    </div>
                </div>
                <div className="instruction-block instruction-block--warning instruction-block-icon">
                    <svg
                        width="32"
                        height="32"
                        viewBox="0 0 32 32"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className="icon warning-icon"
                    >
                        <path
                            d="M7.10666 4.36134C7.99604 4.04398 8.96078 4.00391 9.87342 4.24641C10.7861 4.48891 11.6036 5.00258 12.2182 5.71955C12.8327 6.43652 13.2153 7.32305 13.3154 8.26204C13.4155 9.20103 13.2283 10.1483 12.7787 10.9787L27.0573 25.2587L25.172 27.144L10.892 12.864C10.0614 13.3119 9.11465 13.4976 8.17644 13.3967C7.23822 13.2958 6.3526 12.9129 5.63628 12.2987C4.91995 11.6844 4.40655 10.8675 4.16372 9.9557C3.92089 9.04385 3.96004 8.07983 4.276 7.19067L7.25866 10.1733C7.44316 10.3644 7.66385 10.5167 7.90785 10.6215C8.15186 10.7264 8.4143 10.7815 8.67986 10.7838C8.94542 10.7861 9.20878 10.7355 9.45457 10.635C9.70036 10.5344 9.92367 10.3859 10.1115 10.1981C10.2992 10.0103 10.4477 9.78704 10.5483 9.54124C10.6489 9.29545 10.6995 9.03209 10.6972 8.76653C10.6949 8.50097 10.6397 8.23853 10.5349 7.99453C10.43 7.75052 10.2777 7.52983 10.0867 7.34534L7.10533 4.36L7.10666 4.36134ZM20.9293 6.87334L25.172 4.516L27.0573 6.40134L24.7 10.644L22.3427 11.116L19.516 13.944L17.6293 12.0587L20.4573 9.23067L20.9293 6.87334V6.87334ZM11.972 17.716L13.8573 19.6013L6.78666 26.672C6.54626 26.9131 6.22274 27.0531 5.88244 27.0633C5.54213 27.0734 5.21081 26.9531 4.95642 26.7268C4.70202 26.5005 4.54381 26.1855 4.51423 25.8464C4.48465 25.5072 4.58594 25.1696 4.79733 24.9027L4.90133 24.7867L11.972 17.716Z"
                            fill="black"
                        />
                    </svg>
                    <div>
                        <p>
                            <span>Технические требования к онлайн-интервью</span>
                        </p>
                        <ol className="block-list">
                            <li>
                                <span>Положение лица. </span>В кадр должно полностью попадать Ваше лицо. Лицо должно быть
                                отчетливо видно, камера должна быть не сильно далеко от Вас.
                                Изображение лица должно быть четким, строго в анфас.
                            </li>
                            <li>
                                <span>Положение камеры. </span> Вы должны находиться перпендикулярно камере,
                                желательно чтобы камера находилась на уровне глаз. В случае,
                                если камера расположена сбоку от Вас, то после прочтения ответа
                                повернитесь в камеру и давайте ответ, глядя в ее объектив.
                            </li>
                            <li>
                                <span>Качественное освещение. </span> Направьте камеру так, чтобы не было
                                засвеченных участков. Уберите источники света в кадре (ими могут
                                быть лампы, свет из окна).
                            </li>
                            <li>
                                <span>Обстановка и внешний фон. </span> Для прохождения видеоинтервью
                                потребуется 15-20 минут, выберите спокойное и комфортное место,
                                чтобы Вас ничего не отвлекало (шум, какие-то посторонние
                                предметы и т.д.)
                            </li>
                        </ol>
                    </div>
                </div>
                <div className="instruction-block instruction-block--info instruction-block-icon">
                    <svg
                        width="32"
                        height="32"
                        viewBox="0 0 32 32"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className="icon info-icon"
                    >
                        <path
                            d="M16.0001 30C18.7691 30 21.4758 29.1789 23.7781 27.6405C26.0804 26.1022 27.8748 23.9157 28.9344 21.3575C29.9941 18.7994 30.2713 15.9844 29.7311 13.2687C29.1909 10.553 27.8575 8.05841 25.8996 6.10048C23.9417 4.14254 21.4471 2.80917 18.7314 2.26898C16.0156 1.72878 13.2007 2.00603 10.6425 3.06566C8.08438 4.12528 5.89788 5.9197 4.35954 8.22199C2.8212 10.5243 2.00012 13.231 2.00012 16C2.00012 19.713 3.47511 23.274 6.10062 25.8995C8.72613 28.525 12.2871 30 16.0001 30V30ZM16.0001 3.99997C18.3735 3.99997 20.6936 4.70376 22.667 6.02234C24.6403 7.34091 26.1784 9.21505 27.0867 11.4078C27.9949 13.6005 28.2326 16.0133 27.7695 18.3411C27.3065 20.6688 26.1636 22.807 24.4854 24.4853C22.8072 26.1635 20.669 27.3064 18.3412 27.7694C16.0134 28.2324 13.6006 27.9948 11.4079 27.0865C9.2152 26.1783 7.34106 24.6402 6.02248 22.6668C4.7039 20.6934 4.00012 18.3733 4.00012 16C4.00012 12.8174 5.2644 9.76513 7.51484 7.51469C9.76527 5.26425 12.8175 3.99997 16.0001 3.99997Z"
                            fill="black"
                        />
                        <path d="M17.0001 24H15.0001V13H17.0001V24Z" fill="black" />
                        <path
                            d="M16.0001 9.99997C16.2968 9.99997 16.5868 9.912 16.8335 9.74717C17.0801 9.58235 17.2724 9.34808 17.3859 9.07399C17.4995 8.7999 17.5292 8.49831 17.4713 8.20733C17.4134 7.91636 17.2706 7.64909 17.0608 7.43931C16.851 7.22953 16.5837 7.08667 16.2928 7.02879C16.0018 6.97091 15.7002 7.00062 15.4261 7.11415C15.152 7.22768 14.9177 7.41994 14.7529 7.66661C14.5881 7.91329 14.5001 8.2033 14.5001 8.49997C14.5001 8.89779 14.6582 9.27932 14.9395 9.56063C15.2208 9.84193 15.6023 9.99997 16.0001 9.99997Z"
                            fill="black"
                        />
                    </svg>
                    <div>
                        <p>
                            Если у Вас остались вопросы, Вы заметили какие-то неточности в
                            работе сервиса или произошел технический сбой, пожалуйста,
                            напишите об этом на адрес электронной почты:
                        </p>
                        <p>
                            <a href="mailto:egor.aksamentov.96@mail.ru">
                                egor.aksamentov.96@mail.ru
                            </a>
                        </p>
                        <p>Спасибо за участие и помощь в создании помощника "Аватар".</p>
                        <p>Успехов!</p>
                    </div>
                </div>
            </div>
        );
    }
}

export default Instructions;
